# EXL_GetSheetIndex

## Description
Gets index of the Excel sheet.

```pascal
FUNCTION EXL_GetSheetIndex(
				sheetName         : STRING;
				VAR outSheetIndex : INTEGER): BOOLEAN;
```

```python
def vs.EXL_GetSheetIndex(sheetName):
    return (BOOLEAN, outSheetIndex)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetName|STRING|   |
|outSheetIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2021

## Category
* Excel